cli/tshark.html
<!DOCTYPE html>
<html>
<head>
<title>Tshark</title>
<!-- 2018-02-06 Tue 23:28 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Tshark</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本原理</a>
<ul>
<li><a href="#sec-1-1">1.1. 基本用法</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 抓包</a></li>
<li><a href="#sec-1-1-2">1.1.2. 抓包停止条件</a></li>
<li><a href="#sec-1-1-3">1.1.3. 查看包的信息</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 系统信息查询</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 查看所有网络接口</a></li>
<li><a href="#sec-1-2-2">1.2.2. 查看所有支持字段</a></li>
<li><a href="#sec-1-2-3">1.2.3. 查看所有支持协议</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 使用示例</a>
<ul>
<li><a href="#sec-2-1">2.1. 查看间隔时间内的数据通信量</a></li>
<li><a href="#sec-2-2">2.2. 禁用相对序号</a></li>
<li><a href="#sec-2-3">2.3. 过滤 http 信息</a></li>
<li><a href="#sec-2-4">2.4. 解密 https</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-06 23:28:37</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本原理</a>
<ul>
<li><a href="#sec-1-1">1.1. 基本用法</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 抓包</a></li>
<li><a href="#sec-1-1-2">1.1.2. 抓包停止条件</a></li>
<li><a href="#sec-1-1-3">1.1.3. 查看包的信息</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 系统信息查询</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 查看所有网络接口</a></li>
<li><a href="#sec-1-2-2">1.2.2. 查看所有支持字段</a></li>
<li><a href="#sec-1-2-3">1.2.3. 查看所有支持协议</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 使用示例</a>
<ul>
<li><a href="#sec-2-1">2.1. 查看间隔时间内的数据通信量</a></li>
<li><a href="#sec-2-2">2.2. 禁用相对序号</a></li>
<li><a href="#sec-2-3">2.3. 过滤 http 信息</a></li>
<li><a href="#sec-2-4">2.4. 解密 https</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本原理</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 基本用法</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 抓包</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
略（参见 tcpdump ）
</p>
</div>
</div>


<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 抓包停止条件</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><code>-c</code> : 指定抓包数量
</li>

<li><code>-a duration:5</code> : 指定抓包时间（秒）
</li>

<li><code>-a filesize:10</code> : 指定 ring buffer 文件大小（ KB ）
</li>

<li><code>-a files:7</code> : 指定 ring buffer 文件数量
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 查看包的信息</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-sh">tshark -r &lt;pcap-file&gt;
</pre>
</div>


<p>
选项说明：
</p>

<ul class="org-ul">
<li><code>-r</code> : 指定读入的 pcap 文件
</li>
<li><code>-Y &lt;display filter pattern&gt;</code> : 指定 display 过滤表达式
</li>
<li><code>-V</code> : 显示包的详细信息
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 系统信息查询</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 查看所有网络接口</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<code>tshark -D</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 查看所有支持字段</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<code>tshark -G fields</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 查看所有支持协议</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
<code>tshark -G protocols</code>
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 使用示例</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 查看间隔时间内的数据通信量</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">## 以 10 秒为间隔
tshark -r pcap -q -z io,stat,10
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 禁用相对序号</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">-o 'tcp.relative_sequence_numbers:FALSE'
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 过滤 http 信息</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">tshark -n -r test.pcap -Tfields -e http.request.uri -e http.host 'http'
# output:
# /index.html     10.74.68.58:8989

## -Tfields -e http.request.uri -e http.host : 指定输出项
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 解密 https</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">export SSLKEYLOGFILE='&lt;path-to-sslkeylog-file&gt;' ## 浏览器用于记录 (Pre)-Master-Secret

tshark -r capture.pcap \
-o 'http.ssl.port:443,10000-20000' \            ## 指定需要解密的端口
-o 'ssl.keylog_file:&lt;path-to-sslkeylog-file&gt;' \
'http'
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>